const minus = require('./minus');
// 20 - 5 เท่ากับ 15
test('20 - 5 เท่ากับ 15', ()=> {
    expect(minus(20,5)).toBe(15);
});

// 100 - 20 เท่ากับ 80
test('100 - 20 เท่ากับ 80', ()=> {
    expect(minus(100,20)).toBe(80);
});

// 50 - 20 เท่ากับ 30
test('50 - 20 เท่ากับ 30', ()=> {
    expect(minus(50,20)).toBe(30);
});

// 10 - 5 เท่ากับ 5
test('10 - 5 เท่ากับ 5', ()=> {
    expect(minus(10,5)).toBe(5);
});

// 25 - 5 เท่ากับ 20
test('25 - 5 เท่ากับ 20', ()=> {
    expect(minus(25,5)).toBe(20);
});




