const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

// 100 + 50 เท่ากับ 150
test('100 + 50 เท่ากับ 150', ()=> {
  expect(sum(100,50)).toBe(150);
});

// 2000 + 100 เท่ากับ 2100
test('2000 + 100 เท่ากับ 2100', ()=> {
  expect(sum(2000,100)).toBe(2100);
});

// 10 + 5 เท่ากับ 15
test('10 + 5 เท่ากับ 15', ()=> {
  expect(sum(10,5)).toBe(15);
});

